Revit 2024 API
IFCConnectedWallData Class
 A class that contains the IFC-specific information about how an element is joined to another element.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class IFCConnectedWallData : IDisposable
Visual Basic
Public Class IFCConnectedWallData _
	Implements IDisposable
Visual C++
public ref class IFCConnectedWallData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCConnectedWallData
See Also
IFCConnectedWallData Members
Autodesk.Revit.DB.IFC Namespace